Documents/ПоступлениеНаРасчетныйСчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ПоступлениеНаРасчетныйСчет</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РасшифровкаПлатежа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДоговорКонтрагента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РеквизитыКонтрагента</Name>
				</Properties>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ОтражениеВУСН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ОтражениеВУСН</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Принимаются</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НеПринимаются</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Распределяются</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ПоступлениеНаРасчетныйСчет/Ext/ObjectModule.bsl
&После("ПередЗаписью")
Процедура ЭТ_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	Если СтрНайти(ВРег(ЭтотОбъект.НазначениеПлатежа), "ИНКАСС") > 0 Тогда
		
		СтатьяИнкассация = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоКоду("00-000010");
		Счет51 = ПланыСчетов.Хозрасчетный.НайтиПоКоду("51");
		Счет5701 = ПланыСчетов.Хозрасчетный.НайтиПоКоду("57.01");

		Если ЗначениеЗаполнено(СтатьяИнкассация) И ЗначениеЗаполнено(Счет51) И ЗначениеЗаполнено(Счет5701) Тогда
			ЭтотОбъект.ВидОперации = Перечисления.ВидыОперацийПоступлениеДенежныхСредств.Инкассация;
			ЭтотОбъект.СчетБанк = Счет51;
			ЭтотОбъект.СчетУчетаРасчетовСКонтрагентом = Счет5701;
			ЭтотОбъект.Содержание_УСН = "Инкассация";
			ЭтотОбъект.СтатьяДвиженияДенежныхСредств = СтатьяИнкассация;

			ЭтотОбъект.РасшифровкаПлатежа.Очистить();
			НоваяСтрока = ЭтотОбъект.РасшифровкаПлатежа.Добавить();
			НоваяСтрока.СуммаПлатежа = ЭтотОбъект.СуммаДокумента;
			НоваяСтрока.СтатьяДвиженияДенежныхСредств = СтатьяИнкассация;
			НоваяСтрока.СчетУчетаРасчетовСКонтрагентом = Счет5701;
			НоваяСтрока.СубконтоКт1 = СтатьяИнкассация;
		КонецЕсли;

		Возврат;
	КонецЕсли;

	Если 
		(ЭтотОбъект.СтатьяДвиженияДенежныхСредств 
			<> ЭТ_ОбщийМодуль2.ПолучитьНастройку("СтатьяДвиженияДенежныхСредствКлиент"))
		И (ЭтотОбъект.СтатьяДвиженияДенежныхСредств 
			<> ЭТ_ОбщийМодуль2.ПолучитьНастройку("СтатьяДвиженияДенежныхСредств"))
	Тогда
		Возврат;
	КонецЕсли;

	Если ЭтотОбъект.СтатьяДвиженияДенежныхСредств = 
		ЭТ_ОбщийМодуль2.ПолучитьНастройку("СтатьяДвиженияДенежныхСредствКлиент") Тогда
		
		Попытка
			ТекущийПрефикс = ЭТ_ОбщийМодуль2.ПолучитьНастройку("Префикс");
			СледНомер = ЭТ_ОбщийМодуль2.ПолучитьКодИзСтроки(
				ЭтотОбъект.НазначениеПлатежа, ТекущийПрефикс);

			Если ПустаяСтрока(СледНомер) Тогда
				Возврат;
			КонецЕсли;

			СледТекЗаявка = ЭТ_ОбщийМодуль2.ПолучитьЗаявкуПоНомеру(СледНомер);
			Если СледТекЗаявка = Неопределено Тогда
				Возврат;
			КонецЕсли;

			Если НЕ СледТекЗаявка.Свойство("supplier_inn") Тогда
				Возврат;
			КонецЕсли;

			СледТекЗаявка.Вставить("ДокументИсточник", ЭтотОбъект.Ссылка);
			ДоговорПокупателя = ЭТ_ОбщийМодуль2.ПолучитьДоговорПокупателя(СледТекЗаявка, Истина);

			парРасшифровкаПлатежа = ЭтотОбъект.РасшифровкаПлатежа.Выгрузить();
			Если парРасшифровкаПлатежа.Количество() > 0 Тогда
				парРасшифровкаПлатежа[0].ДоговорКонтрагента = ДоговорПокупателя;
				ЭтотОбъект.РасшифровкаПлатежа.Загрузить(парРасшифровкаПлатежа);
			КонецЕсли;

			Если СледТекЗаявка.supplier_inn = ЭтотОбъект.Организация.ИНН Тогда
				ЭтотОбъект.ОтражениеВУСН = Перечисления.ОтражениеВУСН.Принимаются;
			Иначе
				ЭтотОбъект.ОтражениеВУСН = Перечисления.ОтражениеВУСН.НеПринимаются;
			КонецЕсли;

			Если ЭтотОбъект.РасшифровкаПлатежа.Количество() > 0 Тогда
				Сч = 0;
				Для Каждого СледСтр Из ЭтотОбъект.РасшифровкаПлатежа Цикл
					Если СокрЛП(СледТекЗаявка.supplier_inn) = СокрЛП(ЭтотОбъект.Организация.ИНН) Тогда
						ЭтотОбъект.РасшифровкаПлатежа[Сч].ПорядокОтраженияАванса =
							Перечисления.ПорядокОтраженияАвансов.ДоходУСН;
					Иначе
						ЭтотОбъект.РасшифровкаПлатежа[Сч].ПорядокОтраженияАванса =
							Перечисления.ПорядокОтраженияАвансов.ДоходКомитента;
					КонецЕсли;
					Сч = Сч + 1;
				КонецЦикла;
			КонецЕсли;

		Исключение
			Сообщить("Ошибка подготовки данных U-ON: " + ОписаниеОшибки());
		КонецПопытки;

	КонецЕсли;

КонецПроцедуры

&После("ОбработкаПроведения")
Процедура ЭТ_ПослеПроведения(Отказ, РежимПроведения)

	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	//Организация = ЭТ_ОбщийМодуль2.ПолучитьНастройку("Организация","");						       
	ТекущийПрефикс = ЭТ_ОбщийМодуль2.ПолучитьНастройку("Префикс");			
	СледНомер = ЭТ_ОбщийМодуль2.ПолучитьКодИзСтроки(ЭтотОбъект.НазначениеПлатежа,ТекущийПрефикс);
	СледТекЗаявка = ЭТ_ОбщийМодуль2.ПолучитьЗаявкуПоНомеру(СледНомер);
	Если СледТекЗаявка.Свойство("supplier_inn") Тогда	
		Если ЭтотОбъект.ВидОперации = Перечисления.ВидыОперацийПоступлениеДенежныхСредств.ОплатаПокупателя Тогда
			Если РасшифровкаПлатежа.Количество()>0 Тогда
				Сч = 0;
				Для Каждого СледСтр ИЗ РасшифровкаПлатежа Цикл   
						Если СокрЛП(СледТекЗаявка.supplier_inn)=СокрЛП(ЭтотОбъект.Организация.ИНН) Тогда
							РасшифровкаПлатежа[Сч].ПорядокОтраженияАванса = Перечисления.ПорядокОтраженияАвансов.ДоходУСН;
						Иначе
							РасшифровкаПлатежа[Сч].ПорядокОтраженияАванса = Перечисления.ПорядокОтраженияАвансов.ДоходКомитента;
						КонецЕсли;
					Сч = Сч + 1;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	
	// Повторяем проверки интеграции, чтобы не дергать U-ON, когда не нужно
	Если ЭТ_ОбщийМодуль2.ПолучитьНастройку("ВыключитьМодуль", Ложь) = Истина Тогда
		Сообщить("Модуль интеграции с U-ON отключен!");
		Возврат;
	КонецЕсли;

	Если ЭТ_ОбщийМодуль2.НуженОбмен(ЭтотОбъект.Организация) = Ложь Тогда
		Возврат;
	КонецЕсли;

	Если 
		(ЭтотОбъект.СтатьяДвиженияДенежныхСредств 
			<> ЭТ_ОбщийМодуль2.ПолучитьНастройку("СтатьяДвиженияДенежныхСредствКлиент"))
		И (ЭтотОбъект.СтатьяДвиженияДенежныхСредств 
			<> ЭТ_ОбщийМодуль2.ПолучитьНастройку("СтатьяДвиженияДенежныхСредств"))
	Тогда
		Возврат;
	КонецЕсли;

	// Интеграция с U-ON выполняется после успешного проведения

	ОтличноеПроведение = Ложь;

	Если ЭтотОбъект.СтатьяДвиженияДенежныхСредств = 
		ЭТ_ОбщийМодуль2.ПолучитьНастройку("СтатьяДвиженияДенежныхСредствКлиент") Тогда

		ЭТ_ОбщийМодуль2.УдалитьПлатежКлиента(ЭтотОбъект.Ссылка);
		Если ЭТ_ОбщийМодуль2.ДобавитьПлатежКлиента(ЭтотОбъект.Ссылка) Тогда
			ОтличноеПроведение = Истина;
		КонецЕсли;

	ИначеЕсли ЭтотОбъект.СтатьяДвиженияДенежныхСредств = 
		ЭТ_ОбщийМодуль2.ПолучитьНастройку("СтатьяДвиженияДенежныхСредств") Тогда

		ЭТ_ОбщийМодуль2.УдалитьПлатежТО(ЭтотОбъект.Ссылка);
		Если ЭТ_ОбщийМодуль2.ДобавитьПлатежТО(ЭтотОбъект.Ссылка) Тогда
			ОтличноеПроведение = Истина;
		КонецЕсли;

	КонецЕсли;

	Если ОтличноеПроведение = Ложь 
		И НЕ ЭТ_ОбщийМодуль2.ПолучитьНастройку("РазрешитьПроведениеБезСБ") Тогда
		Сообщить("Не могу выполнить данную операцию в СБ U-ON");
		Возврат;
	КонецЕсли;

	// Блок работы с КнигаУчетаДоходовИРасходов — после проведения, когда движения уже есть

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|   КнигаУчетаДоходовИРасходов.Регистратор,
	|   КнигаУчетаДоходовИРасходов.Содержание
	|ИЗ
	|   РегистрНакопления.КнигаУчетаДоходовИРасходов КАК КнигаУчетаДоходовИРасходов
	|ГДЕ
	|   КнигаУчетаДоходовИРасходов.Регистратор = &Регистратор";

	Запрос.УстановитьПараметр("Регистратор", ЭтотОбъект.Ссылка);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();

	Пока Выборка.Следующий() Цикл

		НаборЗаписей = РегистрыНакопления.КнигаУчетаДоходовИРасходов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Значение = Выборка.Регистратор;
		НаборЗаписей.Прочитать();

		Для Каждого Запись Из НаборЗаписей Цикл
			Если Найти(Запись.Содержание, "Комиссия банка") > 0 Тогда
				Запись.Содержание = "Комиссия банка";
			КонецЕсли;
		КонецЦикла;

		НаборЗаписей.Записать();

	КонецЦикла;

КонецПроцедуры


//ЭТ_ОбработкаУдаленияПроведения(Отказ)
//При отмене проведения необходимо удалить платеж в СБ
//все предельно просто, пытаемся найти платеж в СБ,  если он есть, то удаляем его
&После("ОбработкаУдаленияПроведения")
Процедура ЭТ_ОбработкаУдаленияПроведения(Отказ)
	Если Отказ Тогда Возврат; КонецЕсли;       
	Если ЭТ_ОбщийМодуль2.НуженОбмен(ЭтотОбъект.Организация) = Ложь Тогда Возврат; КонецЕсли;
	Если ЭтотОбъект.ВидОперации<>Перечисления.ВидыОперацийПоступлениеДенежныхСредств.ОплатаПокупателя Тогда Возврат; КонецЕсли;	
	Если ЭТ_ОбщийМодуль2.ПолучитьНастройку("ВыключитьМодуль",Ложь) = Истина Тогда Сообщить("Модуль интеграции с U-ON отключен!"); Возврат; КонецЕсли;				
	ОтличноеПроведение = Ложь;
	ПараметрыПроведения = Документы.ПоступлениеНаРасчетныйСчет.ПодготовитьПараметрыПроведения(Ссылка, Отказ);
	Если ПараметрыПроведения.Свойство("ДокументСсылка") Тогда
		Если ЭтотОбъект.СтатьяДвиженияДенежныхСредств = ЭТ_ОбщийМодуль2.ПолучитьНастройку("СтатьяДвиженияДенежныхСредствКлиент") Тогда
			Если ЭТ_ОбщийМодуль2.УдалитьПлатежКлиента(ПараметрыПроведения.ДокументСсылка) Тогда
				ОтличноеПроведение = Истина;
			КонецЕсли;				
		ИначеЕсли ЭтотОбъект.СтатьяДвиженияДенежныхСредств = ЭТ_ОбщийМодуль2.ПолучитьНастройку("СтатьяДвиженияДенежныхСредств") Тогда
			Если ЭТ_ОбщийМодуль2.УдалитьПлатежТО(ПараметрыПроведения.ДокументСсылка) Тогда
				ОтличноеПроведение = Истина;
			КонецЕсли;				
		КонецЕсли;
	КонецЕсли;	
	Если ОтличноеПроведение = Ложь И НЕ ЭТ_ОбщийМодуль2.ПолучитьНастройку("РазрешитьПроведениеБезСБ") Тогда Отказ = Истина;  Сообщить("Не могу выполнить данныю операцию в СБ U-ON"); Возврат; КонецЕсли;
КонецПроцедуры

&После("ОбработкаЗаполнения")
Процедура ЭТ_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка) 
КонецПроцедуры
